// const msg = 'Hello';

// (function (name) {
//     console.log(`${msg} + ${name} asdfasf`);
// })('Alex');

// function sayHi(name) {
//     console.log(`${msg} + ${name} asdfasf`);
// }

// sayHi('Alex');

// Спрашиваем число.
// Проверяем что введено число и оно больше 0;
// Если нажата отмена или пустая строка или значение невалидно, переспрашиваем
// Посчитать сумму все четных чисел до этого числа включительно // 2+4+6+8+10
// Посчитать сумму все нечетных чисел до этого числа включительно // 1+3+5+7+9
// Выводим результат
// Сумма четных: 30
// Сумма нечетных: 25
